nikooiko/zephyr/ext/hal/st/stm32cube_subg1/s2lp/S2LP_Library/Inc/S2LP_Regs.h
#define SYNC0_REGMASK			((uint8_t)0xFF)


/**
 * \brief QI register
 * \code
 * Read and Write
 * Default value: 0x01
 * 7:5 SQI_TH: SQI threshold.
 * 4:1 PQI_TH: PQI threshold.
 * 0 SQI_EN: 1: enable the SQI check.
 * \endcode
 */
#define QI_ADDR			((uint8_t)0x37)

#define SQI_TH_REGMASK			((uint8_t)0xE0)
#define PQI_TH_REGMASK			((uint8_t)0x1E)
#define SQI_EN_REGMASK			((uint8_t)0x01)


/**
 * \brief PCKT_PSTMBL register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:0 PCKT_PSTMBL: Set the packet postamble length.
 * \endcode
 */
#define PCKT_PSTMBL_ADDR			((uint8_t)0x38)

#define PCKT_PSTMBL_REGMASK			((uint8_t)0xFF)


/**
 * \brief PROTOCOL2 register
 * \code
 * Read and Write
 * Default value: 0x40
 * 7 CS_TIMEOUT_MASK: 1: enable the CS value contributes to timeout disabling.
 * 6 SQI_TIMEOUT_MASK: 1: enable the SQI value contributes to timeout disabling.
 * 5 PQI_TIMEOUT_MASK: 1: enable the PQI value contributes to timeout disabling.
 * 4:3 TX_SEQ_NUM_RELOAD: TX sequence number to be used when counting reset is required using the related command.
 * 2 FIFO_GPIO_OUT_MUX_SEL: 1: select the almost empty/full control for TX FIFO., 0: select the almost empty/full control for RX FIFO.
 * 1:0 LDC_TIMER_MULT: Set the LDC timer multiplier factor: 00b: x1, 01b: x2, 10b: x4, 11b: x8.
 * \endcode
 */
#define PROTOCOL2_ADDR			((uint8_t)0x39)

#define CS_TIMEOUT_MASK_REGMASK			((uint8_t)0x80)
#define SQI_TIMEOUT_MASK_REGMASK			((uint8_t)0x40)
#define PQI_TIMEOUT_MASK_REGMASK			((uint8_t)0x20)
#define TX_SEQ_NUM_RELOAD_REGMASK			((uint8_t)0x18)
#define FIFO_GPIO_OUT_MUX_SEL_REGMASK			((uint8_t)0x04)
#define LDC_TIMER_MULT_REGMASK			((uint8_t)0x03)


/**
 * \brief PROTOCOL1 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7 LDC_MODE: 1: enable the Low Duty Cycle mode.
 * 6 LDC_RELOAD_ON_SYNC: 1: enable the LDC timer reload mode.
 * 5 PIGGYBACKING: 1: enable the piggybacking.
 * 4 FAST_CS_TERM_EN: 1: enable the RX sniff timer.
 * 3 SEED_RELOAD: 1: enable the reload of the back-off random generator seed using the value written in the BU_COUNTER_SEED.
 * 2 CSMA_ON: 1 enable the CSMA channel access mode.
 * 1 CSMA_PERS_ON: 1: enable the CSMA persistent mode (no backoff cycles).
 * 0 AUTO_PCKT_FLT: 1: enable the automatic packet filtering control.
 * \endcode
 */
#define PROTOCOL1_ADDR			((uint8_t)0x3A)

#define LDC_MODE_REGMASK			((uint8_t)0x80)
#define LDC_RELOAD_ON_SYNC_REGMASK			((uint8_t)0x40)
#define PIGGYBACKING_REGMASK			((uint8_t)0x20)
#define FAST_CS_TERM_EN_REGMASK			((uint8_t)0x10)
#define SEED_RELOAD_REGMASK			((uint8_t)0x08)
#define CSMA_ON_REGMASK			((uint8_t)0x04)
#define CSMA_PERS_ON_REGMASK			((uint8_t)0x02)
#define AUTO_PCKT_FLT_REGMASK			((uint8_t)0x01)


/**
 * \brief PROTOCOL0 register
 * \code
 * Read and Write
 * Default value: 0x08
 * 7:4 NMAX_RETX: Max. number of re-TX (from 0 to 15)(0: re-transmission is not performed).
 * 3 NACK_TX: 1: field NO_ACK=1 on transmitted packet.
 * 2 AUTO_ACK: 1: enable the automatic acknowledgement if packet received request.
 * 1 PERS_RX: 1: enable the persistent RX mode.
 * 0 RESERVED: -
 * \endcode
 */
#define PROTOCOL0_ADDR			((uint8_t)0x3B)

#define NMAX_RETX_REGMASK			((uint8_t)0xF0)
#define NACK_TX_REGMASK			((uint8_t)0x08)
#define AUTO_ACK_REGMASK			((uint8_t)0x04)
#define PERS_RX_REGMASK			((uint8_t)0x02)


/**
 * \brief FIFO_CONFIG3 register
 * \code
 * Read and Write
 * Default value: 0x30
 * 7 RESERVED: -
 * 6:0 RX_AFTHR: Set the RX FIFO almost full threshold.
 * \endcode
 */
#define FIFO_CONFIG3_ADDR			((uint8_t)0x3C)

#define RX_AFTHR_REGMASK			((uint8_t)0x7F)


/**
 * \brief FIFO_CONFIG2 register
 * \code
 * Read and Write
 * Default value: 0x30
 * 7 RESERVED: -
 * 6:0 RX_AETHR: Set the RX FIFO almost empty threshold.
 * \endcode
 */
#define FIFO_CONFIG2_ADDR			((uint8_t)0x3D)

#define RX_AETHR_REGMASK			((uint8_t)0x7F)


/**
 * \brief FIFO_CONFIG1 register
 * \code
 * Read and Write
 * Default value: 0x30
 * 7 RESERVED: -
 * 6:0 TX_AFTHR: Set the TX FIFO almost full threshold.
 * \endcode
 */
#define FIFO_CONFIG1_ADDR			((uint8_t)0x3E)

#define TX_AFTHR_REGMASK			((uint8_t)0x7F)


/**
 * \brief FIFO_CONFIG0 register
 * \code
 * Read and Write
 * Default value: 0x30
 * 7 RESERVED: -
 * 6:0 TX_AETHR: Set the TX FIFO almost empty threshold.
 * \endcode
 */
#define FIFO_CONFIG0_ADDR			((uint8_t)0x3F)

#define TX_AETHR_REGMASK			((uint8_t)0x7F)


/**
 * \brief PCKT_FLT_OPTIONS register
 * \code
 * Read and Write
 * Default value: 0x40
 * 7 RESERVED: -
 * 6 RX_TIMEOUT_AND_OR_SEL: Logical boolean function applied to CS/SQI/PQI values: 1: OR, 0: AND.
 * 5 RESERVED: -
 * 4 SOURCE_ADDR_FLT: 1: RX packet accepted if its source field matches with RX_SOURCE_ADDR register
 * 3 DEST_VS_BROADCAST_ADDR: 1: RX packet accepted if its source field matches with BROADCAST_ADDR register.
 * 2 DEST_VS_MULTICAST_ADDR: 1: RX packet accepted if its destination address matches with MULTICAST_ADDR register.
 * 1 DEST_VS_SOURCE_ADDR: 1: RX packet accepted if its destination address matches with RX_SOURCE_ADDR register.
 * 0 CRC_FLT: 1: packet discarded if CRC is not valid.
 * \endcode
 */
#define PCKT_FLT_OPTIONS_ADDR			((uint8_t)0x40)

#define RX_TIMEOUT_AND_OR_SEL_REGMASK			((uint8_t)0x40)
#define SOURCE_ADDR_FLT_REGMASK			((uint8_t)0x10)
#define DEST_VS_BROADCAST_ADDR_REGMASK			((uint8_t)0x08)
#define DEST_VS_MULTICAST_ADDR_REGMASK			((uint8_t)0x04)
#define DEST_VS_SOURCE_ADDR_REGMASK			((uint8_t)0x02)
#define CRC_FLT_REGMASK			((uint8_t)0x01)


/**
 * \brief PCKT_FLT_GOALS4 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:0 RX_SOURCE_MASK/DUAL_SYNC3: If dual sync mode enabled: dual SYNC word byte 3., Otherwise mask register for source affress filtering.
 * \endcode
 */
#define PCKT_FLT_GOALS4_ADDR			((uint8_t)0x41)

#define RX_SOURCE_MASK_DUAL_SYNC3_REGMASK			((uint8_t)0xFF)


/**
 * \brief PCKT_FLT_GOALS3 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:0 RX_SOURCE_ADDR/DUAL_SYNC2: If dual sync mode enabled: dual SYNC word byte 2., Otherwise RX packet source or TX packet destination field.
 * \endcode
 */
#define PCKT_FLT_GOALS3_ADDR			((uint8_t)0x42)

#define RX_SOURCE_ADDR_DUAL_SYNC2_REGMASK			((uint8_t)0xFF)


/**
 * \brief PCKT_FLT_GOALS2 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:0 BROADCAST_ADDR/DUAL_SYNC1: If dual sync mode enabled: dual SYNC word byte 1., Broadcast address.
 * \endcode
 */
#define PCKT_FLT_GOALS2_ADDR			((uint8_t)0x43)

#define BROADCAST_ADDR_DUAL_SYNC1_REGMASK			((uint8_t)0xFF)


/**
 * \brief PCKT_FLT_GOALS1 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:0 MULTICAST_ADDR/DUAL_SYNC0: If dual sync mode enabled: dual SYNC word byte 0., Multicast address.
 * \endcode
 */
#define PCKT_FLT_GOALS1_ADDR			((uint8_t)0x44)

