nikooiko/zephyr/ext/hal/st/stm32cube_subg1/s2lp/S2LP_Library/Inc/S2LP_Regs.h
#define AFC_CORR_REGMASK			((uint8_t)0xFF)


/**
 * \brief LINK_QUALIF2 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 PQI: PQI value of the received packet.
 * \endcode
 */
#define LINK_QUALIF2_ADDR			((uint8_t)0x9F)

#define PQI_REGMASK			((uint8_t)0xFF)


/**
 * \brief LINK_QUALIF1 register
 * \code
 * Read only
 * Default value: 0x00
 * 7 CS: Carrier Sense indication.
 * 6:0 SQI: SQI value of the recived packet.
 * \endcode
 */
#define LINK_QUALIF1_ADDR			((uint8_t)0xA0)

#define CS_REGMASK			((uint8_t)0x80)
#define SQI_REGMASK			((uint8_t)0x7F)


/**
 * \brief RSSI_LEVEL register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 RSSI_LEVEL: RSSI level captured at the end of the SYNC word detection of the received packet.
 * \endcode
 */
#define RSSI_LEVEL_ADDR			((uint8_t)0xA2)

#define RSSI_LEVEL_REGMASK			((uint8_t)0xFF)


/**
 * \brief RX_PCKT_LEN1 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 RX_PCKT_LEN[14:8]: MSB valueof the length of the packet received.
 * \endcode
 */
#define RX_PCKT_LEN1_ADDR			((uint8_t)0xA4)

#define RX_PCKT_LEN_14_8_REGMASK			((uint8_t)0xFF)


/**
 * \brief RX_PCKT_LEN0 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 RX_PCKT_LEN[7:0]: LSB valueof the length of the packet received.
 * \endcode
 */
#define RX_PCKT_LEN0_ADDR			((uint8_t)0xA5)

#define RX_PCKT_LEN_7_0_REGMASK			((uint8_t)0xFF)


/**
 * \brief CRC_FIELD3 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 CRC_FIELD3: CRC field 3 of the received packet.
 * \endcode
 */
#define CRC_FIELD3_ADDR			((uint8_t)0xA6)

#define CRC_FIELD3_REGMASK			((uint8_t)0xFF)


/**
 * \brief CRC_FIELD2 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 CRC_FIELD2: CRC field 2 of the received packet.
 * \endcode
 */
#define CRC_FIELD2_ADDR			((uint8_t)0xA7)

#define CRC_FIELD2_REGMASK			((uint8_t)0xFF)


/**
 * \brief CRC_FIELD1 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 CRC_FIELD1: CRC field 1 of the received packet.
 * \endcode
 */
#define CRC_FIELD1_ADDR			((uint8_t)0xA8)

#define CRC_FIELD1_REGMASK			((uint8_t)0xFF)


/**
 * \brief CRC_FIELD0 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 CRC_FIELD0: CRC field 0 of the received packet.
 * \endcode
 */
#define CRC_FIELD0_ADDR			((uint8_t)0xA9)

#define CRC_FIELD0_REGMASK			((uint8_t)0xFF)


/**
 * \brief RX_ADDRE_FIELD1 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 RX_ADDRE_FIELD1: Source address field of the received packet.
 * \endcode
 */
#define RX_ADDRE_FIELD1_ADDR			((uint8_t)0xAA)

#define RX_ADDRE_FIELD1_REGMASK			((uint8_t)0xFF)


/**
 * \brief RX_ADDRE_FIELD0 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 RX_ADDRE_FIELD0: Destination address field of the received packet.
 * \endcode
 */
#define RX_ADDRE_FIELD0_ADDR			((uint8_t)0xAB)

#define RX_ADDRE_FIELD0_REGMASK			((uint8_t)0xFF)


/**
 * \brief RSSI_LEVEL_RUN register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 RSSI_LEVEL_RUN: RSSI level of the received packet, which supports continuos fast SPI reading.
 * \endcode
 */
#define RSSI_LEVEL_RUN_ADDR			((uint8_t)0xEF)

#define RSSI_LEVEL_RUN_REGMASK			((uint8_t)0xFF)


/**
 * \brief DEVICE_INFO1 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 PARTNUM: S2-LP part number
 * \endcode
 */
#define DEVICE_INFO1_ADDR			((uint8_t)0xF0)

#define PARTNUM_REGMASK			((uint8_t)0xFF)


/**
 * \brief DEVICE_INFO0 register
 * \code
 * Read only
 * Default value: 0x41
 * 7:0 RSSI_LEVEL: S2-LP version number
 * \endcode
 */
#define DEVICE_INFO0_ADDR			((uint8_t)0xF1)

#define RSSI_LEVEL_REGMASK			((uint8_t)0xFF)


/**
 * \brief IRQ_STATUS3 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 INT_LEVEL[31:24]: Interrupt status register 3
 * \endcode
 */
#define IRQ_STATUS3_ADDR			((uint8_t)0xFA)

#define INT_LEVEL_31_24_REGMASK			((uint8_t)0xFF)


/**
 * \brief IRQ_STATUS2 register
 * \code
 * Read only
 * Default value: 0x09
 * 7:0 INT_LEVEL[23:16]: Interrupt status register 2
 * \endcode
 */
#define IRQ_STATUS2_ADDR			((uint8_t)0xFB)

#define INT_LEVEL_23_16_REGMASK			((uint8_t)0xFF)


/**
 * \brief IRQ_STATUS1 register
 * \code
 * Read only
 * Default value: 0x05
 * 7:0 INT_LEVEL[15:8]: Interrupt status register 1
 * \endcode
 */
#define IRQ_STATUS1_ADDR			((uint8_t)0xFC)

#define INT_LEVEL_15_8_REGMASK			((uint8_t)0xFF)


/**
 * \brief IRQ_STATUS0 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 INT_LEVEL[7:0]: Interrupt status register 0
 * \endcode
 */
#define IRQ_STATUS0_ADDR			((uint8_t)0xFD)

#define INT_LEVEL_7_0_REGMASK			((uint8_t)0xFF)


/******************* (C) COPYRIGHT 2015 STMicroelectronics *****END OF FILE****/
